Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Do not mix `persistence.xml` and `quarkus.hibernate-orm.*` properties in `{config-file}`. Quarkus will raise an exception. Make up your mind on which approach you want to use.
ja_jp: `persistence.xml` への設定と `{config-file}` に `quarkus.hibernate-orm.*` のプロパティを使用することを混在させないでください。Quarkusは例外を発生させます。どちらの方法を採用するかを決めてください。

source: Do not mix xref:persistence-xml[`persistence.xml`] and `quarkus.hibernate-orm.*` properties in `{config-file}`. Quarkus will raise an exception. Make up your mind on which approach you want to use.
ja_jp: xref:persistence-xml[persistence.xml] と `{config-file}` の `quarkus.hibernate-orm.*` プロパティは混ぜないでください。Quarkusは例外を発生させます。どちらのアプローチを使用するか、決めてください。

source: Do not set `quarkus.datasource[.optional name].jdbc.url` or `quarkus.datasource[.optional name].reactive.url`.
ja_jp: `quarkus.datasource[.optional name].jdbc.url` または `quarkus.datasource[.optional name].reactive.url` を設定しないでください。

source: Do not set `quarkus.mongodb[.optional name].hosts` or `quarkus.mongodb[.optional name].connection-#string#`.
ja_jp: `quarkus.mongodb[.optional name].hosts` または `quarkus.mongodb[.optional name].connection-#string#` を設定しない。

source: Do not set `quarkus.redis[.optional name].hosts` or `quarkus.redis[.optional name].hosts-provider-name`.
ja_jp: `quarkus.redis[.optional name].hosts` または `quarkus.redis[.optional name].hosts-provider-name` を設定しない。

source: Do not start the Keycloak server when you <<bearer-token-tutorial-keycloak-dev-mode,run the application in dev mode>>; `Dev Services for Keycloak` will start and configure a container. For more information, see the <<bearer-token-tutorial-keycloak-dev-mode>> section.
ja_jp: アプリケーションを <<bearer-token-tutorial-keycloak-dev-mode,開発モードで実行>> するときは、Keycloak サーバーを起動しないでください。`Dev Services for Keycloak` がコンテナーを起動して設定します。 詳細は、<<bearer-token-tutorial-keycloak-dev-mode>> セクションを参照してください。

source: Do not start the Keycloak server when you run the application in a dev mode - `Dev Services for Keycloak` will launch a container. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information.
ja_jp: アプリケーションを開発モードで実行するときは、Keycloakサーバーを起動しないでください - `Dev Services for Keycloak` がコンテナを起動します。詳細については、下記の link:#keycloak-dev-mode[開発モードでのアプリケーションの実行] セクションを参照してください。

source: Do not start the Keycloak server when you run the application in a dev mode - `Dev Services for Keycloak` will launch a container. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information. Make sure to put the {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] on the classpath (`target/classes` directory) so that it gets imported automatically when running in dev mode - unless you have already built a {quickstarts-tree-url}/security-openid-connect-quickstart[complete solution] in which case this realm file will be added to the classpath during the build.
ja_jp: アプリケーションを開発モードで実行しているときは、Keycloak サーバーを起動しないでください。 `Dev Services for Keycloak` はコンテナーを起動します。詳細については、以下の <<keycloak-dev-mode, Running the Application in Dev mode>> セクションを参照してください。 {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[レルム設定ファイル] をクラスパス (`target/classes` ディレクトリー) に配置して、開発モードで実行しているときに自動的にインポートされるようにします (すでに {quickstarts-tree-url}/security-openid-connect-quickstart[完全なソリューション] をビルドしている場合を除く (このレルムファイルはビルド時にクラスパスに追加されます))。

source: Do not start the Keycloak server when you run the application in a dev mode - `Dev Services for Keycloak` will launch a container. See xref:keycloak-dev-mode[Running the Application in Dev mode] section below for more information.
ja_jp: アプリケーションをdevモードで実行するときは、Keycloakサーバーを起動しないでください - `Dev Services for Keycloak` はコンテナを起動します。詳細は、以下の xref:keycloak-dev-mode[Devモードでアプリケーションを実行] セクションを参照してください。

source: Do not start the Keycloak server when you run the application in dev mode or test modes - `Dev Services for Keycloak` will launch a container. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information. Make sure to put the {quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[realm configuration file] on the classpath (`target/classes` directory) so that it gets imported automatically when running in dev mode - unless you have already built a {quickstarts-tree-url}/security-openid-connect-quickstart[complete solution] in which case this realm file will be added to the classpath during the build.
ja_jp: アプリケーションを開発モードまたはテストモードで実行しているときは、Keycloak サーバーを起動しないでください。 `Dev Services for Keycloak` はコンテナーを起動します。詳細については、以下の <<keycloak-dev-mode, 開発モードでのアプリケーションの実行>> セクションを参照してください。{quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[レルム設定ファイル] をクラスパス (`target/classes` ディレクトリー) に配置して、開発モードで実行しているときに自動的にインポートされるようにします (すでに {quickstarts-tree-url}/security-openid-connect-quickstart[完全なソリューション] をビルドしている場合を除く (このレルムファイルはビルド時にクラスパスに追加されます))。

source: Do not start the Keycloak server when you run the application in dev mode. Dev Services for Keycloak launches a container. For more information, see the <<keycloak-dev-mode,Running the application in Dev mode>> section.
ja_jp: アプリケーションを開発モードで実行するときは、Keycloak サーバーを起動しないでください。 Dev Services for Keycloak がコンテナーを起動します。 詳細は、<<keycloak-dev-mode,開発モードでアプリケーションを実行する>> セクションを参照してください。

source: Do not start the Keycloak server when you run the application in dev mode; `Dev Services for Keycloak` will start a container. For more information, see the <<bearer-token-tutorial-keycloak-dev-mode>> section.
ja_jp: アプリケーションを開発モードで実行するときは、Keycloak サーバーを起動しないでください。`Dev Services for Keycloak` がコンテナーを起動します。 詳細は、<<bearer-token-tutorial-keycloak-dev-mode>> セクションを参照してください。

source: Do not start the Keycloak server when you run the application in dev or test modes; `Dev Services for Keycloak` launches a container. For more information, see the <<oidc-client-keycloak-dev-mode,Running the application in dev mode>> section. Ensure you put the link:{quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[realm configuration file] on the classpath, in the `target/classes` directory. This placement ensures that the file is automatically imported in dev mode. However, if you have already built a link:{quickstarts-tree-url}/security-openid-connect-quickstart[complete solution], you do not need to add the realm file to the classpath because the build process has already done so.
ja_jp: アプリケーションを開発モードまたはテストモードで実行するときは、Keycloak サーバーを起動しないでください。 `Dev Services for Keycloak` がコンテナーを起動します。 詳細は、<<oidc-client-keycloak-dev-mode,Running the application in dev mode>> セクションを参照してください。 必ず、 `target/classes` ディレクトリーのクラスパス上に link:{quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[レルム設定ファイル] を挿入してください。 この配置により、ファイルが開発モードで自動的にインポートされるようになります。 ただし、すでに link:{quickstarts-tree-url}/security-openid-connect-quickstart[全ソリューション] を構築している場合は、ビルドプロセスによってすでに実行されているため、レルムファイルをクラスパスに追加する必要はありません。

source: Do not start your application yet.
ja_jp: アプリケーションはまだ開始しないでください。

source: Do not try and set configuration for accessing the new service directly using system properties or other overrides; use `configProvider()` instead
ja_jp: システムプロパティーやその他のオーバーライドを使用して、新しいサービスにアクセスするための設定を直接設定しようとしないでください。代わりに `configProvider()` を使用してください。

source: Do not use Profile aware files to set `quarkus.config.profile.parent`. This will not work because the profile is required in advance to load the profile aware files.
ja_jp: `quarkus.config.profile.parent` を設定するために、プロファイル毎のファイルを使用しないでください。プロファイル毎のファイルの読み込みには、あらかじめプロファイルが必要なため、この方法ではうまくいきません。

source: Do not use Profile-aware files to set `quarkus.config.profile.parent`. This will not work because the profile is required in advance to load the profile-aware files.
ja_jp: `quarkus.config.profile.parent` を設定するために、プロファイル対応ファイルを使用しないでください。プロファイル対応ファイルをロードする前にプロファイルが必要になるため、この方法ではうまくいきません。

source: Do not use `System.getProperty(String)` or `System.getEnv(String)` to retrieve configuration values. These APIs are not configuration aware and do not support the features described in this guide.
ja_jp: 設定値を取得するために `System.getProperty(String)` または `System.getEnv(String)` を使用しないでください。これらの API は設定に対応しておらず、このガイドで説明されている機能をサポートしていません。

source: Do not use `quarkus.hibernate-orm.database.generation` `drop-and-create` and `update` in your production environment.
ja_jp: 本番環境では、 `quarkus.hibernate-orm.database.generation` で `drop-and-create` と `update` は使用しないでください。

source: Do not use `quarkus.hibernate-orm.schema-management.strategy` `drop-and-create` and `update` in your production environment.
ja_jp: 本番環境では `quarkus.hibernate-orm.schema-management.strategy` に `drop-and-create` や `update` を使用しないでください。

source: Do not use an unbounded dynamic name for loggers, for example, `for (int i ...) { Logger.getLogger("logger-name." + i).info("my log") }`.
ja_jp: ロガーに対して、 `for (int i ...) { Logger.getLogger("logger-name." + i).info("my log") }` のような、制限のない動的な名前を使用しないでください。

source: Do not use profile-aware files to set `quarkus.profile` or `quarkus.test.profile`. This will not work because the profile is required in advance to load the profile-aware files.
ja_jp: `quarkus.profile` または `quarkus.test.profile` を設定する際に、プロファイル対応ファイルは使用しないでください。これらのプロファイルは、プロファイル対応ファイルをロードする前に必要になるため、この方法は機能しません。

source: Do not use static variables in the extension processor
ja_jp: エクステンションプロセッサーで静的変数を使用しないこと。

source: Do not use the `<<>>` format with the verbatim heading or section description, such as `\<<Title heading>>`.
ja_jp: `\<<Title heading>>` のように、 逐語的な見出しやセクションの説明に `<<>` 形式を使用しないでください。

source: Do not use the `RestClientWithOidcClientFilter` and `RestClientWithTokenPropagationFilter` interfaces in the same REST client because they can conflict, leading to issues. For example, the OIDC client filter can override the token from the OIDC token propagation filter, or the propagation filter might not work correctly if it attempts to propagate a token when none is available, expecting the OIDC client filter to obtain a new token instead.
ja_jp: `RestClientWithOidcClientFilter` インターフェイスと `RestClientWithTokenPropagationFilter` インターフェイスを同じ REST クライアントで使用しないでください。競合して問題が発生する可能性があります。 たとえば、OIDC クライアントフィルターは、OIDC トークン伝播フィルターからのトークンをオーバーライドできます。また、利用可能なトークンがない場合に伝播フィルターがトークンを伝播しようとして、代わりに OIDC クライアントフィルターが新しいトークンを取得するように要求し、伝播フィルターが正しく機能しない可能性があります。

source: Do not use this feature to implement an RPC timeout. To implement an RPC timeout, either use Mutiny `call.ifNoItem().after(...)` or Fault Tolerance `@Timeout`.
ja_jp: この機能を使用して、RPC タイムアウトを実装しないでください。RPC タイムアウトを実装するには、Mutiny `call.ifNoItem().after(…​)` または Fault Tolerance `@Timeout` のいずれかを使用してください。

source: Do not use this in production. This should only be used in a development environment. You should not run production application in dev mode.
ja_jp: 本番環境では使用しないでください。開発環境でのみ使用してください。本番環境のアプリケーションを開発モードで実行してはいけません。

source: Do not use this in production. This should only be used in a development environment. You should not run production applications in dev mode.
ja_jp: 本番環境では使用しないでください。開発環境でのみ使用してください。本番環境のアプリケーションを開発モードで実行してはいけません。

source: Do other extensions work with it?
ja_jp: 他のエクステンションでも動作しますか?

source: Do the local logout by clearing the session cookie.
ja_jp: セッション Cookie をクリアしてローカルログアウトを実行します。

source: Do the remote call and return its result
ja_jp: リモートコールを行い、その結果を返却

source: Do use Vault, you need the https://github.com/quarkiverse/quarkus-vault[Quarkus Vault] extension. More details about this extension and its configuration can be found in the https://docs.quarkiverse.io/quarkus-vault/dev/index.html[extension documentation].
ja_jp: Vault を使用するには、 https://github.com/quarkiverse/quarkus-vault[Quarkus Vault] エクステンションが必要です。このエクステンションとその設定の詳細は、 https://docs.quarkiverse.io/quarkus-vault/dev/index.html[エクステンションのドキュメント] を参照してください。

source: Do use Vault, you need the https://github.com/quarkiverse/quarkus-vault[Quarkus Vault] extension. More details about this extension and its configuration can be found in the https://quarkiverse.github.io/quarkiverse-docs/quarkus-vault/dev/index.html[extension documentation].
ja_jp: Vaultを使用するには、 link:https://github.com/quarkiverse/quarkus-vault[Quarkus Vault] エクステンションが必要です。このエクステンションとその設定の詳細については、 link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-vault/dev/index.html[エクステンションのドキュメント] を参照してください。

source: Do whatever is required by the application once the authenticated users land on this page. In this case, they are redirected to the secured `/protected` resource. This `/protected` endpoint may be an internal endpoint. If the secured `/protected` endpoint is also publicly accessible and unauthenticated users try to access it, then they will still land on this `LoginService` page first after authenticating with GitHub, and be redirected to the `/protected` page next.
ja_jp: 認証済みユーザーがこのページに到達したら、アプリケーションで必要な処理を何でも行ってください。この例では、保護された `/protected` リソースにリダイレクトされます。この `/protected` エンドポイントは内部的なエンドポイントかもしれません。保護された `/protected` エンドポイントがパブリックにもアクセス可能で、未認証のユーザーがそこにアクセスしようとした場合でも、GitHub で認証した後はまずこの `LoginService` ページに到達し、次に `/protected` ページにリダイレクトされます。

source: Do you have Quarkus skills and want to join the band? Want to help present the shows? Become a Roadie and join the tour.
ja_jp: Quarkusのスキルを持っていて、バンドに参加したいと思いますか？ショーの演出を手伝いたいですか？ローディーになってツアーに参加しましょう。

source: Do you need a ready-to-use PostgreSQL server to try out the examples?
ja_jp: サンプルを試すためにすぐに使えるPostgreSQLサーバーが必要ですか?

source: Do you want to know more? Here you are, some MTA related resources:
ja_jp: もっと知りたいですか？ここでは、MTA関連のリソースをご紹介します。

source: Do you want to learn more about the Quarkus application data caching abilities? The following sections will show you everything there is to know about it.
ja_jp: Quarkusアプリケーションのデータキャッシング機能について詳しく知りたいですか?以下のセクションでは、この機能について知っておくべきことをすべて紹介します。

source: Docker Options
ja_jp: Docker オプション

source: Docker and Docker Compose
ja_jp: DockerとDocker Compose

source: Docker and Docker Compose or xref:podman.adoc[Podman], and Docker Compose
ja_jp: Docker と Docker Compose、または xref:podman.adoc[Podman] 、および Docker Compose

source: Docker and S2i properties
ja_jp: Docker と S2i のプロパティー

source: Docker compatibility mode
ja_jp: Docker互換モード

source: Docker for Mac workaround.
ja_jp: Docker for Macの回避策。

source: Docker image:: for the actual `Dockerfile` definition and when the tool chain is involved
ja_jp: Docker image:: 実際の `Dockerfile` 定義とツールチェーンが関連する場合

source: Docs for Quarkiverse or other third-party extensions are pulled directly from those repositories.
ja_jp: Quarkiverse やその他のサードパーティーのエクステンションのドキュメントは、それらのリポジトリーから直接取得されます。

source: Docs for Quarkiverse or other third-party extensions are pulled from those repositories.
ja_jp: Quarkiverse やその他のサードパーティーのエクステンションのドキュメントは、それらのリポジトリから取得されます。

source: Document Preview
ja_jp: ドキュメントのプレビュー

source: Document attributes and variables
ja_jp: ドキュメント属性と変数

source: Document header
ja_jp: ドキュメントヘッダー

source: Document preview
ja_jp: ドキュメントのプレビュー

source: Document structure
ja_jp: ドキュメント構造

source: Document your REST APIs with OpenAPI - comes with Swagger UI
ja_jp: OpenAPI で REST API をドキュメント化する – Swagger UI が付属

source: Documentation
ja_jp: ドキュメント

source: Documentation about the Vert.x Mutiny variant is available on https://smallrye.io/smallrye-mutiny-vertx-bindings.
ja_jp: Vert.x Mutiny版に関するドキュメントは https://smallrye.io/smallrye-mutiny-vertx-bindings にあります。

source: Documentation aggregation
ja_jp: ドキュメントの集約

source: Documentation and links
ja_jp: ドキュメントとリンク

source: Documentation built from the main branch is published nightly (main-SNAPSHOT).
ja_jp: mainブランチからビルドされたドキュメントは毎晩公開されます(main-SNAPSHOT)。

source: Documentation for Quarkus core and most extensions is in the `docs` directory of the {quarkus-docs}[Quarkus GitHub repository].
ja_jp: Quarkus のコアおよびほとんどのエクステンションのドキュメントは、 {quarkus-docs}[Quarkus GitHub リポジトリ] の `docs` ディレクトリーにあります。

source: Documentation for Quarkus core and most extensions is located in the `docs` module of the https://github.com/quarkusio/quarkus/tree/main/docs[Quarkus GitHub repository].
ja_jp: Quarkus コアおよびほとんどのエクステンションのドキュメントは、 https://github.com/quarkusio/quarkus/tree/main/docs[Quarkus GitHub リポジトリー] の docs モジュールにあります。

source: Documentation for other branches is published at release time.
ja_jp: その他のブランチのドキュメントは、リリース時に公開されます。

source: Documentation of the queryable method
ja_jp: クエリー可能なメソッドのドキュメントです。

source: Documents are processed by a "Text Splitter" to break them into smaller chunks.
ja_jp: ドキュメントは「Text Splitter」によって処理され、より小さなチャンクに分割されます。

source: Does Micrometer support annotations?
ja_jp: Micrometerはアノテーションをサポートしていますか？

source: Does RESTEasy Reactive require Hibernate Reactive?
ja_jp: RESTEasy ReactiveはHibernate Reactiveを必要としますか?

source: Does it do 2 Phase Commit and slow down my app?
ja_jp: それは2フェーズコミットを行い、私のアプリの速度を遅くしますか?

source: Does it work everywhere I want to?
ja_jp: 使いたいところなら、どこでも使えるのでしょうか？

source: Does this mean I can go back to writing code since I don't have to deal with service configurations anymore because Quarkus does it for me?
ja_jp: これは、Quarkusが私に代わってサービス構成を処理してくれるので私が取り組む必要がなくなったため、コーディングに戻れることを意味していますか？

source: Doesn't have a one-to-one mapping to a CDI annotation.
ja_jp: CDIアノテーションとの1対1のマッピングはありません。

source: Doesn't have a one-to-one mapping to a CDI annotation. Depending on the value of @Scope, one of the @Singleton, @ApplicationScoped, @SessionScoped, @RequestScoped, @Dependent could be used
ja_jp: CDI アノテーションへの 1 対 1 のマッピングはありません。Scope の値に応じて、@Singleton、@ApplicationScoped、@SessionScoped、@RequestScoped、@Dependent のいずれかが使用されます

source: Doesn't have a one-to-one mapping to a CDI annotation. It is not used in Quarkus because Quarkus does all classpath scanning at build time.
ja_jp: CDIアノテーションへの1対1のマッピングはありません。Quarkusはビルド時にすべてのクラスパスのスキャンを行うため、Quarkusでは使用されません。

source: Doing less
ja_jp: 無駄をなくす

source: Domain sockets are not yet supported with io_uring.
ja_jp: ドメイン・ソケットはio_uringではまだサポートされていません。

source: Don't forget that you need to have a container runtime available, or you will start seeing failures in the Quarkus logs at this point.
ja_jp: コンテナーランタイムが利用可能である必要がある点を忘れないでください。 そうしないと、この時点で Quarkus のログにエラーが表示され始めます。

source: Don't forget the `@Transactional` annotation, which ensures writes are wrapped in a transaction.
ja_jp: `@Transactional` アノテーションを忘れずに追加してください。これにより、書き込み処理がトランザクション内で 実行されるようになります。

source: Don't forget to add `http://localhost:8080` as a redirect URI for testing during development purposes. You should get a client id and secret generated once a Spotify application setup has been complete, for example:
ja_jp: 開発目的のテスト用に、リダイレクト URI として `http://localhost:8080` を追加することを忘れないでください。Spotify アプリケーションのセットアップが完了すると、クライアント ID とシークレットが生成されます。以下に例を示します。

source: Don't forget to add a message for the user to let them know everything went fine
ja_jp: すべてがうまくいったことを知らせるために、ユーザーにメッセージを追加することを忘れないでください。

source: Don't forget to add the database connector library of choice. Here we are using PostgreSQL as identity store.
ja_jp: 選択したデータベースコネクタライブラリを追加することを忘れないでください。ここでは、PostgreSQLをIDストアとして使用しています。

source: Don't forget to make sure the bean state guarantees the visibility, e.g. via the `volatile` keyword.
ja_jp: Beanの状態が可視性を保証していることを担保することを忘れないでください。たとえば、 `volatile` キーワードです。

source: Don't forget to make this xref:building-my-first-extension.adoc#deploying-the-greeting-feature[build step] conditional on being in dev mode
ja_jp: この link:building-my-first-extension.html#deploying-the-greeting-feature[ビルドステップ]では、devモードであることを条件とすることを忘れないでください。

source: Don't forget to set your page title in the `title` template parameter
ja_jp: `title` テンプレートパラメーターにページタイトルを設定することを忘れないでください。

source: Don't inject a `DataSource` or `AgroalDatasource` directly, because that would lead to a failure on startup (can't inject inactive beans). Instead, inject `InjectableInstance<DataSource>` or `InjectableInstance<AgroalDataSource>`.
ja_jp: `DataSource` または `AgroalDatasource` を直接注入しないでください。 起動時に失敗する可能性があるためです (非アクティブな Bean を注入できません)。 代わりに、 `InjectableInstance<DataSource>` または `InjectableInstance<AgroalDataSource>` を注入します。

source: Don't need to choose one either. Quarkus automatically includes the Agroal connection pool; configure your datasource as in the above examples and it will set up Hibernate ORM to use Agroal. More details about this connection pool can be found in xref:datasource.adoc[Quarkus - Datasources].
ja_jp: どちらかを選択する必要はありません。上記の例のようにデータソースを設定するだけで、Hibernate ORMがAgroalを使用するように設定されます。このコネクションプールの詳細については、 xref:datasource.adoc[Quarkus - データソース]を参照してください。

source: Don't need to choose one either. Quarkus automatically includes the Agroal connection pool; configure your datasource as in the above examples and it will setup Hibernate ORM to use Agroal. More details about this connection pool can be found in xref:datasource.adoc[Quarkus - Datasources].
ja_jp: どちらかを選択する必要はありません。上記の例のようにデータソースを設定すると、Hibernate ORMがAgroalを使用するように設定されます。この接続プールの詳細については、 xref:datasource.adoc[Quarkus - Datasources] を参照してください。

source: Don't see and extension you need? <a href="{{site.baseurl}}/createextensions">Request a new extension</a>
ja_jp: 必要なエクステンションが見つからない場合は、<a href="{{site.baseurl}}/createextensions">新しいエクステンションをリクエスト</a>してください

source: Don't touch anything, keep `App IDs` selected, and press `Continue`:
ja_jp: 何も触れないで、 `App IDs` を選択したまま `Continue` を押します。

source: Don't touch anything, keep `App` selected, and press `Continue`:
ja_jp: 何も触れないで、 `App` を選択したまま `Continue` を押します。

source: Don't use *BASIC* in production environments by default, performance might be impacted.
ja_jp: 本番環境ではデフォルトで *BASICを* 使用しないでください。パフォーマンスに影響が出る可能性があります。

source: Don't use this in production.
ja_jp: 実稼働環境では使用しないでください。

source: Don't write parts of the query that you don't need: write `Person.find("order by name")` or `Person.find("name = ?1 and status = ?2", "Loïc", Status.Alive)` or even better `Person.find("name", "Loïc")`.
ja_jp: 必要のない部分を書かないようにしましょう: `Person.find("order by name")` や `Person.find("name = ?1 and status = ?2", "Loïc", Status.Alive)` 、さらには `Person.find("name", "Loïc")` のように書きましょう。

source: Don't write parts of the query that you don't need: write `Person.find("order by name")` or `Person.find("name = ?1 and status = ?2", "stef", Status.Alive)` or even better `Person.find("name", "stef")`.
ja_jp: `Person.find("order by name")` や `Person.find("name = ?1 and status = ?2", "stef", Status.Alive)` 、さらには `Person.find("name", "stef")` のように、必要のない部分を書かないようにしましょう。

source: Don’t forget to set up the Panache and PostgreSQL JDBC driver, please see xref:hibernate-orm-panache.adoc#setting-up-and-configuring-hibernate-orm-with-panache[Setting up and configuring Hibernate ORM with Panache] for more information.
ja_jp: Panache と PostgreSQL JDBC ドライバーのセットアップを忘れないでください。詳細は、xref:hibernate-orm-panache.adoc#setting-up-and-configuring-hibernate-orm-with-panache[Panache を使用した Hibernate ORM のセットアップと設定] を参照してください。

source: Download an {quickstarts-archive-url}[archive] or clone the git repository:
ja_jp: {quickstarts-archive-url}[アーカイブ] をダウンロードするか、git リポジトリーをクローンします。

source: Download an {quickstarts-archive-url}[archive].
ja_jp: {quickstarts-archive-url}[アーカイブ] をダウンロードする。

source: Download and install the https://marketplace.visualstudio.com/items?itemName=redhat.vscode-extension-bpmn-editor[Red Hat BPMN Editor VSCode Extension] to edit and model process definitions from VSCode IDE.
ja_jp: VSCode IDE からプロセス定義を編集およびモデル化するために、 https://marketplace.visualstudio.com/items?itemName=redhat.vscode-extension-bpmn-editor[Red Hat BPMN エディタ VSCode エクステンション] をダウンロードしてインストールします。
